# FileName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..FileName Property
ExporterIFC Class See Also
---
The name of the IFC file being exported.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string FileName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FileName As String
	Get
```

Visual C++
---
```text
public:
property String^ FileName {
	String^ get ();
}
```

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace